# Inline Views and ROWNUM

### Inline Views
Inline views allow us to reuse derived columns like annual salary in filtering.

In [ ]:
SELECT ename, sal, sal*12 annual_salary FROM emp WHERE annual_salary > 30000;

In [ ]:
SELECT * FROM (SELECT ename, sal, sal*12 annual_salary FROM emp) WHERE annual_salary > 30000;

### ROWNUM Basics
ROWNUM generates sequential numbers for rows in the result set.

In [ ]:
SELECT rownum, ename FROM emp;

In [ ]:
SELECT rownum, ename FROM emp WHERE deptno = 10;

In [ ]:
SELECT * FROM emp WHERE rownum = 1;

In [ ]:
SELECT * FROM emp WHERE rownum = 2;

In [ ]:
SELECT * FROM emp WHERE rownum <= 5;

Use ORDER BY with a subquery to select top 5 employees by salary.

In [ ]:
SELECT * FROM (SELECT * FROM emp ORDER BY sal DESC) WHERE rownum <= 5;

### Nth Highest Salary with ROWNUM
Fetch the 5th highest salary employee using MINUS with rownum filtering.

In [ ]:
SELECT * FROM (SELECT * FROM emp ORDER BY sal DESC) WHERE rownum <= 5
MINUS 
SELECT * FROM (SELECT * FROM emp ORDER BY sal DESC) WHERE rownum <= 4;